---
title: PipeFittingAndAccessoryConnectorData
classe: Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryConnectorData
namespace: Autodesk.Revit.DB.Plumbing
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 13
---

# PipeFittingAndAccessoryConnectorData

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double Angle { get; }` | `pipeFittingAndAccessoryConnectorData.Angle` | Double |
| `Double Diameter { get; }` | `pipeFittingAndAccessoryConnectorData.Diameter` | Double |
| `Double Flow { get; }` | `pipeFittingAndAccessoryConnectorData.Flow` | Double |
| `FlowDirectionType FlowDirection { get; }` | `pipeFittingAndAccessoryConnectorData.FlowDirection` | FlowDirectionType |
| `Double Height { get; }` | `pipeFittingAndAccessoryConnectorData.Height` | Double |
| `Int32 Index { get; }` | `pipeFittingAndAccessoryConnectorData.Index` | Int32 |
| `Boolean IsValidObject { get; }` | `pipeFittingAndAccessoryConnectorData.IsValidObject` | Boolean |
| `Int32 LinkIndex { get; }` | `pipeFittingAndAccessoryConnectorData.LinkIndex` | Int32 |
| `ConnectorProfileType Profile { get; }` | `pipeFittingAndAccessoryConnectorData.Profile` | ConnectorProfileType |
| `Double VelocityPressure { get; }` | `pipeFittingAndAccessoryConnectorData.VelocityPressure` | Double |
| `Double Width { get; }` | `pipeFittingAndAccessoryConnectorData.Width` | Double |
| `Void Dispose()` | `pipeFittingAndAccessoryConnectorData.Dispose()` | Void |
| `Transform GetCoordination()` | `pipeFittingAndAccessoryConnectorData.GetCoordination()` | Transform |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```